using System;
/* Написать программу подсчета количества «хороших» чисел в диапазоне от 1 до 1 000 000 000.
 * «Хорошим» называется число, которое делится на ​сумму своих цифр​.
 * Реализовать подсчёт времени выполнения программы, используя структуру DateTime
 *  
 * coded by Олег Саврик
 */

namespace goodNumbers
{
    class Program
    {
        static void Main(string[] args)
        {
            DateTime start = DateTime.Now;

            for (int i = 0; i < 1000; i++)
            {





            }







            Console.WriteLine($"Программа отработала {DateTime.Now - start}");
            Console.ReadKey();
        }
    }
}
