using System;
/*
 * Реализуйте задачу 1 в виде статического класса StaticClass;
 * а) Класс должен содержать статический метод, который принимает на вход массив и решает задачу 1;
 * б) *Добавьте статический метод для считывания массива из текстового файла. Метод должен возвращать массив целых чисел;
 * в)**Добавьте обработку ситуации отсутствия файла на диске. 
 * 
 *  coded by Олег Саврик
 */

namespace arrayStaticClass
{
    public static class ArrayStaticClass
    {
        int[] array;



    }



    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
